W8D1/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adasd"], ["description", "sadas"], ["moderator_id", 8], ["created_at", "2020-09-14 21:06:28.065734"], ["updated_at", "2020-09-14 21:06:28.065734"]]

    def update
        # @sub = Sub.find(params[:id])
        # if @sub.moderator_id == current_user.id
        @sub = current_user.subs.find_by(id: params[:id])
        if @sub
            if @sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "steak"], ["updated_at", "2020-09-14 21:41:49.981883"], ["id", 3]]