W6D5/cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birthdate", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "orange"], ["sex", "F"], ["description", "i am a acat"], ["updated_at", "2020-09-04 23:35:03.433182"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)