W8D1/reddit_clone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "D5dcc4KkcTuGpvVQauA7cw"], ["updated_at", "2020-09-14 20:47:52.982942"], ["id", 3]]