W7D2/music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find(params[:id])
        if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "changed name"], ["updated_at", "2020-09-09 22:03:57.838118"], ["id", 1]]

    def destroy
        # debugger
        @band = Band.find(params[:id])
        Band.delete(@band)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]